#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_lb.tech_lb: Reading...
data.aws_lb.tech_lb: Read complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:019248244455:loadbalancer/net/a40dfd5e082f549829d4be5b805c6614/bf19b6032ca24b2c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "auto_deploy"  = "true"
          + "redeployment" = "2be88ca4242c76e8253ac62474851065032d6833"
        }
    }

  # aws_api_gateway_integration.proxy will be created
  + resource "aws_api_gateway_integration" "proxy" {
      + cache_namespace         = (known after apply)
      + connection_id           = (known after apply)
      + connection_type         = "VPC_LINK"
      + content_handling        = "CONVERT_TO_TEXT"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "ANY"
      + passthrough_behavior    = "WHEN_NO_MATCH"
      + request_parameters      = {
          + "integration.request.header.Accept"        = "'application/json'"
          + "integration.request.header.Authorization" = "method.request.header.Authorization"
          + "integration.request.path.proxy"           = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "http://a40dfd5e082f549829d4be5b805c6614-bf19b6032ca24b2c.elb.us-east-1.amazonaws.com/{proxy}"
    }

  # aws_api_gateway_integration.root will be created
  + resource "aws_api_gateway_integration" "root" {
      + cache_namespace         = (known after apply)
      + connection_id           = (known after apply)
      + connection_type         = "VPC_LINK"
      + content_handling        = "CONVERT_TO_TEXT"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "ANY"
      + passthrough_behavior    = "WHEN_NO_MATCH"
      + request_parameters      = {
          + "integration.request.header.Accept"        = "'application/json'"
          + "integration.request.header.Authorization" = "method.request.header.Authorization"
          + "integration.request.path.proxy"           = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "http://a40dfd5e082f549829d4be5b805c6614-bf19b6032ca24b2c.elb.us-east-1.amazonaws.com/"
    }

  # aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Authorization" = true
          + "method.request.path.proxy"           = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method.root will be created
  + resource "aws_api_gateway_method" "root" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Authorization" = true
          + "method.request.path.proxy"           = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Foobar Gateway VPC Link. Managed by Terraform."
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "tech_gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.stage_dev will be created
  + resource "aws_api_gateway_stage" "stage_dev" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_api_gateway_vpc_link.main will be created
  + resource "aws_api_gateway_vpc_link" "main" {
      + arn         = (known after apply)
      + description = "Foobar Gateway VPC Link. Managed by Terraform."
      + id          = (known after apply)
      + name        = "tech_vpclink_teste"
      + tags_all    = (known after apply)
      + target_arns = [
          + "arn:aws:elasticloadbalancing:us-east-1:019248244455:loadbalancer/net/a40dfd5e082f549829d4be5b805c6614/bf19b6032ca24b2c",
        ]
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + base_url           = (known after apply)
  + lb_output_arn      = "arn:aws:elasticloadbalancing:us-east-1:019248244455:loadbalancer/net/a40dfd5e082f549829d4be5b805c6614/bf19b6032ca24b2c"
  + lb_output_dns_name = "a40dfd5e082f549829d4be5b805c6614-bf19b6032ca24b2c.elb.us-east-1.amazonaws.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*